# Дві крапки виведуть діапазон від символа до символа, включно

(-2..2).each {|x| puts x}
puts "=================="
(0..10).each {|x| puts x}
puts "=================="
(10..11).each {|x| puts x}

puts "=================="

puts "=================="

# Три крапки виводить range без останньої цифри (символа)

(-2...2).each {|x| puts x}
puts "=================="
(0...10).each {|x| puts x}
puts "=================="
(10...11).each {|x| puts x}

# Діапазон букв

("a".."b").each { |x| puts x}
puts "=================="
("aa".."bb").each {|x| puts x}
puts "=================="
("cde"..."fff").each {|x| puts x}